Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/berkeley_api.c
/*******************************************************************************
  Company:
    Microchip Technology Inc.

  File Name:
    berkeley_api.c

  Summary:
    

  Description:
    Berkeley Socket Distribution(BSD) APIs for Microchip TCPIP Stack

 *******************************************************************************/

//DOM-IGNORE-BEGIN
/*******************************************************************************
Copyright (c) <2014> released Microchip Technology Inc.  All rights reserved.

 * Confirmed By jinzhouyun, Date 2016.10.01
 *******************************************************************************/
//DOM-IGNORE-END

#include <xc.h>
#include "tcpip/tcpip.h"

#if defined(STACK_USE_BERKELEY_API)

static bool HandlePossibleTCPDisconnection(SOCKET s);

// Array of BSDSocket elements; used to track all socket state and connection information.
static struct BSDSocket BSDSocketArray[BSD_SOCKET_COUNT];

// Contains the next local port number to associate with a socket.
static uint16_t gAutoPortNumber = 1024;

/*****************************************************************************
  Function:
    void BerkeleySocketInit(void)

  Summary:
    Initializes the Berkeley socket structure array.

  Description:
    This function initializes the Berkeley socket array. This function should
    be called before any BSD socket call.

  Precondition:
    None.

  Parameters:
    None.

  Returns:
    None

  Remarks:
    None.
 ***************************************************************************/
void BerkeleySocketInit(void)
{
    unsigned int s;
    struct BSDSocket *socket;

    for (s = 0; s < BSD_SOCKET_COUNT; s++) {
        socket = (struct BSDSocket *) &BSDSocketArray[s];
        socket->bsdState = SKT_CLOSED;
        socket->SocketID = INVALID_UDP_SOCKET;
    }
}

/*****************************************************************************
  Function:
    SOCKET socket( int af, int type, int protocol )

  Summary:
    This function creates a new Berkeley socket.

  Description:
    This function creates a new BSD socket for the microchip
    TCPIP stack. The return socket descriptor is used for the subsequent
    BSD operations.

  Precondition:
    BerkeleySocketInit function should be called.

  Parameters:
    af - address family - AF_INET.
    type - socket type SOCK_DGRAM or SOCK_STREAM.
    protocol - IP protocol IPPROTO_UDP or IPPROTO_TCP.

  Returns:
    New socket descriptor. INVALID_SOCKET in case of error.

  Remarks:
    None.
 ***************************************************************************/
SOCKET socket(int af, int type, int protocol)
{
    struct BSDSocket *socket = BSDSocketArray;
    SOCKET s;

    if (af != AF_INET)
        return INVALID_SOCKET;

    if (protocol == IPPROTO_IP) {
        switch (type) {
        case SOCK_DGRAM:
            protocol = IPPROTO_UDP;
            break;

        case SOCK_STREAM:
            protocol = IPPROTO_TCP;
            break;

        default:
            break;
        }
    }

    for (s = 0; s < BSD_SOCKET_COUNT; s++, socket++) {
        if (socket->bsdState != SKT_CLOSED) //socket in use
            continue;

        socket->SocketType = type;

        if (type == SOCK_DGRAM && protocol == IPPROTO_UDP) {
            socket->bsdState = SKT_CREATED;
            return s;
        } else if (type == SOCK_STREAM && protocol == IPPROTO_TCP) {
            socket->bsdState = SKT_CREATED;
            return s;
        } else
            return INVALID_SOCKET;
    }

    return INVALID_SOCKET;
}

/*****************************************************************************
  Function:
    int bind( SOCKET s, const struct sockaddr *name, int namelen )

  Summary:
    This function assigns a name to the socket descriptor.

  Description:
    The bind function assigns a name to an unnamed socket. The
    name represents the local address of the communication
    endpoint. For sockets of type SOCK_STREAM, the name of the
    remote endpoint is assigned when a connect or accept function
    is executed.

  Precondition:
    socket function should be called.

  Parameters:
    s - Socket descriptor returned from a previous call to socket.
    name - pointer to the sockaddr structure containing the
    local address of the socket.
    namelen - length of the sockaddr structure.

  Returns:
    If bind is successful, a value of 0 is returned. A return
    value of SOCKET_ERROR indicates an error.

  Remarks:
    None.
 ***************************************************************************/
int bind(SOCKET s, const struct sockaddr *name, int namelen)
{
    struct BSDSocket *socket;
    struct sockaddr_in *local_addr;
    uint16_t lPort;

    if (s >= BSD_SOCKET_COUNT)
        return SOCKET_ERROR;

    socket = &BSDSocketArray[s];

    if (socket->bsdState != SKT_CREATED) // only work with recently created socket
        return SOCKET_ERROR;

    if ((unsigned int) namelen < sizeof (struct sockaddr_in))
        return SOCKET_ERROR;

    local_addr = (struct sockaddr_in *) name;

    lPort = local_addr->sin_port;
    if (lPort == 0u) // pick a port
    {
        lPort = gAutoPortNumber++;
        if (gAutoPortNumber > 5000u) // reset the port numbers
            gAutoPortNumber = 1024;
    }

    if (socket->SocketType == SOCK_DGRAM) {
        socket->SocketID = UDPOpenEx(0, UDP_OPEN_SERVER, lPort, 0);
        if (socket->SocketID == INVALID_UDP_SOCKET)
            return SOCKET_ERROR;
    }

    socket->localPort = lPort;
    socket->bsdState = SKT_BOUND;
    return 0; // success
}

/*****************************************************************************
  Function:
    int listen( SOCKET s, int backlog )

  Summary:
    The listen function sets the specified socket in a listen mode

  Description:
    This function sets the specified socket in a listen
    mode. Calling the listen function indicates that the
    application is ready to accept connection requests arriving
    at a socket of type SOCK_STREAM. The connection request is
    queued (if possible) until accepted with an accept function.
    The backlog parameter defines the maximum number of pending
    connections that may be queued.

  Precondition:
    bind() must have been called on the s socket first.

  Parameters:
    s - Socket identifier returned from a prior socket() call.
    backlog - Maximum number of connection requests that can be queued.  Note
        that each backlog requires a TCP_PURPOSE_BERKELEY_SERVER type TCP
        socket to be allocated in the TCPSocketInitializer[] in tcpip_config.h.
        Also, ensure that BSD_SOCKET_COUNT (also in tcpip_config.h) is greater
        than the backlog by at least 1 (more if you have other BSD sockets in
        use).

  Returns:
    Returns 0 on success, else return SOCKET_ERROR.

