Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/berkeley_api.c
  Remarks:
    None
 ***************************************************************************/
int listen(SOCKET s, int backlog)
{
    struct BSDSocket *ps;
    SOCKET clientSockID;
    unsigned int socketcount;
    unsigned char assigned;

    if (s >= BSD_SOCKET_COUNT)
        return SOCKET_ERROR;

    ps = &BSDSocketArray[s];

    if (ps->SocketType != SOCK_STREAM)
        return SOCKET_ERROR;

    if (ps->bsdState == SKT_BSD_LISTEN)
        backlog = ps->backlog;

    if ((ps->bsdState != SKT_BOUND) && (ps->bsdState != SKT_BSD_LISTEN))
        return SOCKET_ERROR;

    while (backlog--) {
        assigned = 0;
        for (socketcount = 0; socketcount < BSD_SOCKET_COUNT; socketcount++) {
            if (BSDSocketArray[socketcount].bsdState != SKT_CLOSED)
                continue;

            clientSockID = TCPOpen(0, TCP_OPEN_SERVER, ps->localPort, TCP_PURPOSE_BERKELEY_SERVER);
            if (clientSockID == INVALID_SOCKET)
                return SOCKET_ERROR;

            // Clear the first reset flag
            TCPWasReset(clientSockID);

            assigned = 1;
            ps->bsdState = SKT_BSD_LISTEN;
            ps->backlog = backlog;

            BSDSocketArray[socketcount].SocketID = clientSockID;
            BSDSocketArray[socketcount].bsdState = SKT_LISTEN;
            BSDSocketArray[socketcount].isServer = true;
            BSDSocketArray[socketcount].localPort = ps->localPort;
            BSDSocketArray[socketcount].SocketType = SOCK_STREAM;
            break;
        }
        if (!assigned)
            return SOCKET_ERROR;
    }
    return 0; // Success
}

/*****************************************************************************
  Function:
    SOCKET accept(SOCKET s, struct sockaddr *addr, int *addrlen)

  Summary:
    This function accepts connection requests queued for a listening socket.

  Description:
    The accept function is used to accept connection requests
    queued for a listening socket. If a connection request is
    pending, accept removes the request from the queue, and a new
    socket is created for the connection. The original listening
    socket remains open and continues to queue new connection
    requests. The socket must be a SOCK_STREAM type socket.

  Precondition:
    listen function should be called.

  Parameters:
    s - Socket descriptor returned from a previous call to
    socket. must be bound to a local name and in listening mode.
    addr - Optional pointer to a buffer that receives the address
    of the connecting entity.
    addrlen - Optional pointer to an integer that contains the
    length of the address addr

  Returns:
    If the accept function succeeds, it returns a non-negative
    integer that is a descriptor for the accepted socket.
    Otherwise, the value INVALID_SOCKET is returned.

  Remarks:
    None.
 ***************************************************************************/
SOCKET accept(SOCKET s, struct sockaddr *addr, int *addrlen)
{
    struct BSDSocket *pListenSock;
    SOCKET_INFO *remoteSockInfo;
    struct sockaddr_in *addrRemote;
    unsigned int sockCount;
    TCP_SOCKET hTCP;

    if (s >= BSD_SOCKET_COUNT)
        return INVALID_SOCKET;

    pListenSock = &BSDSocketArray[s]; /* Get the pointer to listening server socket */

    if (pListenSock->bsdState != SKT_BSD_LISTEN)
        return INVALID_SOCKET;
    if (pListenSock->SocketType != SOCK_STREAM)
        return INVALID_SOCKET;

    for (sockCount = 0; sockCount < BSD_SOCKET_COUNT; sockCount++) {
        if (BSDSocketArray[sockCount].bsdState != SKT_LISTEN)
            continue;

        if (BSDSocketArray[sockCount].localPort != pListenSock->localPort)
            continue;

        hTCP = BSDSocketArray[sockCount].SocketID;

        // We don't care about connections and disconnections before we can
        // process them, so clear the reset flag
        TCPWasReset(hTCP);

        if (TCPIsConnected(hTCP)) {
            remoteSockInfo = TCPGetRemoteInfo(hTCP);
            if (addr) {
                if (addrlen) {
                    if ((unsigned int) *addrlen < sizeof (struct sockaddr_in))
                        return INVALID_SOCKET;
                    addrRemote = (struct sockaddr_in *) addr;
                    addrRemote->sin_addr.S_un.S_addr = remoteSockInfo->remote.IPAddr.Val;
                    addrRemote->sin_port = remoteSockInfo->remotePort.Val;
                    *addrlen = sizeof (struct sockaddr_in);
                }
            }
            BSDSocketArray[sockCount].remotePort = remoteSockInfo->remotePort.Val;
            BSDSocketArray[sockCount].remoteIP = remoteSockInfo->remote.IPAddr.Val;
            BSDSocketArray[sockCount].bsdState = SKT_EST;
            return sockCount;
        }
    }

    return INVALID_SOCKET;
}

/*****************************************************************************
  Function:
    int connect( SOCKET s, struct sockaddr *name, int namelen )

  Summary:
    This function connects to the peer communications end point.

  Description:
    The connect function assigns the address of the peer
    communications endpoint. For stream sockets, connection is
    established between the endpoints. For datagram sockets, an
    address filter is established between the endpoints until
    changed with another connect() function.

  Precondition:
    socket function should be called.

  Parameters:
    s - Socket descriptor returned from a previous call to socket.
    name - pointer to the sockaddr structure containing the
    peer address and port number.
    namelen - length of the sockaddr structure.

  Returns:
    If the connect() function succeeds, it returns 0. Otherwise,
    the value SOCKET_ERROR is returned to indicate an error
    condition. For stream based socket, if the connection is not
    established yet, connect returns SOCKET_CNXN_IN_PROGRESS.

  Remarks:
    None.
 ***************************************************************************/
int connect(SOCKET s, struct sockaddr *name, int namelen)
{
    struct BSDSocket *socket;
    struct sockaddr_in *addr;
    uint32_t remoteIP;
    uint16_t remotePort;
    uint16_t localPort;

