Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/berkeley_api.c
    if (s >= BSD_SOCKET_COUNT)
        return SOCKET_ERROR;

    socket = &BSDSocketArray[s];

    if (socket->bsdState < SKT_CREATED)
        return SOCKET_ERROR;

    if ((unsigned int) namelen < sizeof (struct sockaddr_in))
        return SOCKET_ERROR;

    addr = (struct sockaddr_in *) name;
    remotePort = addr->sin_port;
    remoteIP = addr->sin_addr.S_un.S_addr;

    if (remoteIP == 0u || remotePort == 0u)
        return SOCKET_ERROR;

    if (socket->SocketType == SOCK_STREAM) {
        switch (socket->bsdState) {
        case SKT_EST:
            return 0; // already established

        case SKT_IN_PROGRESS:
            if (HandlePossibleTCPDisconnection(s))
                return SOCKET_ERROR;

            if (!TCPIsConnected(socket->SocketID))
                return SOCKET_CNXN_IN_PROGRESS;

            socket->bsdState = SKT_EST;
            return 0; // success

        case SKT_CREATED:
        case SKT_BOUND:
            socket->SocketID = TCPOpen(remoteIP, TCP_OPEN_IP_ADDRESS, remotePort, TCP_PURPOSE_BERKELEY_CLIENT);
            if (socket->SocketID == INVALID_SOCKET)
                return SOCKET_ERROR;

            // Clear the first reset flag
            TCPWasReset(socket->SocketID);

            socket->isServer = false;
            socket->bsdState = SKT_IN_PROGRESS;
            return SOCKET_CNXN_IN_PROGRESS;

        default:
            return SOCKET_ERROR;
        }
    } else {
        // If not explicitly bound to a local port, implicitly do the binding
        if (socket->bsdState == SKT_CREATED) {
            localPort = gAutoPortNumber++;
            if (gAutoPortNumber > 5000u) // reset the port numbers
                gAutoPortNumber = 1024;

            socket->SocketID = UDPOpenEx(0, UDP_OPEN_SERVER, localPort, remotePort);
            if (socket->SocketID == INVALID_UDP_SOCKET)
                return SOCKET_ERROR;
            socket->bsdState = SKT_BOUND;
        }
        if (socket->bsdState != SKT_BOUND)
            return SOCKET_ERROR;

        // UDP: remote port is used as a filter. Need to call connect when using
        // send/recv calls. No need to call 'connect' if using sendto/recvfrom
        // calls.
        socket->remotePort = remotePort;
        socket->remoteIP = remoteIP;
        return 0; // success
    }
    return SOCKET_ERROR;
}

/*****************************************************************************
  Function:
    int send( SOCKET s, const char *buf, int len, int flags )

  Summary:
    The send function is used to send outgoing data on an already
    connected socket.

  Description:
    The send function is used to send outgoing data on an already
    connected socket. This function is used to send a reliable,
    ordered stream of data bytes on a socket of type SOCK_STREAM
    but can also be used to send datagrams on a socket of type SOCK_DGRAM.

  Precondition:
    connect function should be called for TCP and UDP sockets.
    Server side, accept function should be called.

  Parameters:
    s - Socket descriptor returned from a previous call to socket.
    buf - application data buffer containing data to transmit.
    len - length of data in bytes.
    flags - message flags. Currently this field is not supported.

  Returns:
    On success, send returns number of bytes sent. In case of
    error, returns SOCKET_ERROR. a zero indicates no data send.

  Remarks:
    None.
 ***************************************************************************/
int send(SOCKET s, const char *buf, int len, int flags)
{
    return sendto(s, buf, len, flags, NULL, 0);
}

/*****************************************************************************
  Function:
    int sendto(SOCKET s, const char *buf, int len, int flags, const struct sockaddr *to, int tolen)

  Summary:
    This function used to send the data for both connection oriented and connection-less
    sockets.

  Description:
    The sendto function is used to send outgoing data on a socket.
    The destination address is given by to and tolen. Both
    Datagram and stream sockets are supported.

  Precondition:
    socket function should be called.

  Parameters:
    s - Socket descriptor returned from a previous call to socket.
    buf - application data buffer containing data to transmit.
    len - length of data in bytes.
    flags - message flags. Currently this field is not supported.
    to - Optional pointer to the the sockaddr structure containing the
        destination address.  If NULL, the currently bound remote port and IP
        address are used as the destination.
    tolen - length of the sockaddr structure.

  Returns:
    On success, sendto returns number of bytes sent. In case of
    error returns SOCKET_ERROR

  Remarks:
    None.
 ***************************************************************************/
int sendto(SOCKET s, const char *buf, int len, int flags, const struct sockaddr *to, int tolen)
{
    struct BSDSocket *socket;
    int size = SOCKET_ERROR;
    NODE_INFO remoteInfo;
    static uint32_t startTick; // NOTE: startTick really should be a per socket BSDSocket structure member since other BSD calls can interfere with the ARP cycles
    uint16_t wRemotePort;
    struct sockaddr_in local;

    if (s >= BSD_SOCKET_COUNT)
        return SOCKET_ERROR;

    socket = &BSDSocketArray[s];

    if (socket->bsdState == SKT_CLOSED)
        return SOCKET_ERROR;

    if (socket->SocketType == SOCK_DGRAM) // UDP
    {
        // Decide the destination IP address and port
        remoteInfo.IPAddr.Val = socket->remoteIP;
        wRemotePort = socket->remotePort;
        if (to) {
            if ((unsigned int) tolen != sizeof (struct sockaddr_in))
                return SOCKET_ERROR;
            wRemotePort = ((struct sockaddr_in*) to)->sin_port;
            remoteInfo.IPAddr.Val = ((struct sockaddr_in*) to)->sin_addr.s_addr;

            // Implicitly bind the socket if it isn't already
            if (socket->bsdState == SKT_CREATED) {
                memset(&local, 0x00, sizeof (local));
                if (bind(s, (struct sockaddr*) &local, sizeof (local)) == SOCKET_ERROR)
                    return SOCKET_ERROR;
            }
        }
        if (remoteInfo.IPAddr.Val == IP_ADDR_ANY)
            remoteInfo.IPAddr.Val = 0xFFFFFFFFu;

        // Set the remote IP and MAC address if it is different from what we already have stored in the UDP socket
        if (UDPSocketInfo[socket->SocketID].remote.remoteNode.IPAddr.Val != remoteInfo.IPAddr.Val) {
            if (ARPIsResolved(&remoteInfo.IPAddr, &remoteInfo.MACAddr)) {
                memcpy((void *) &UDPSocketInfo[socket->SocketID].remote.remoteNode, (void *) &remoteInfo, sizeof (remoteInfo));
            } else {
                if (TickGet() - startTick > 1 * TICK_SECOND) {
                    ARPResolve(&remoteInfo.IPAddr);
                    startTick = TickGet();
                }
                return SOCKET_ERROR;
            }
        }

        // Select the UDP socket and see if we can write to it
        if (UDPIsPutReady(socket->SocketID)) {
            // Set the proper remote port
            UDPSocketInfo[socket->SocketID].remotePort = wRemotePort;

            // Write data and send UDP datagram
            size = UDPPutArray((uint8_t *) buf, len);
            UDPFlush();
            return size;
        }
    } else if (socket->SocketType == SOCK_STREAM) // TCP will only send to the already established socket.
    {
        if (socket->bsdState != SKT_EST)
            return SOCKET_ERROR;

        if (HandlePossibleTCPDisconnection(s))
            return SOCKET_ERROR;

        // Handle special case were 0 return value is okay
        if (len == 0)
            return 0;

        // Write data to the socket. If one or more bytes were written, then
        // return this value.  Otherwise, fail and return SOCKET_ERROR.
        size = TCPPutArray(socket->SocketID, (uint8_t *) buf, len);
        if (size)
            return size;
    }
    return SOCKET_ERROR;
}

/*****************************************************************************
  Function:
    int recv( SOCKET s, char *buf, int len, int flags )

  Summary:
    The recv() function is used to receive incoming data that has
    been queued for a socket.

  Description:
    The recv() function is used to receive incoming data that has
    been queued for a socket. This function can be used with both
    datagram and stream socket. If the available data
    is too large to fit in the supplied application buffer buf,
    excess bytes are discarded in case of SOCK_DGRAM type
    sockets.  For SOCK_STREAM types, the data is buffered
    internally so the application can retreive all data by
    multiple calls of recvfrom.

  Precondition:
    connect function should be called for TCP and UDP sockets.
    Server side, accept function should be called.

  Parameters:
    s - Socket descriptor returned from a previous call to socket.
    buf - application data receive buffer.
    len - buffer length in bytes.
    flags - no significance in this implementation

  Returns:
    If recv is successful, the number of bytes copied to
    application buffer buf is returned. A value of zero indicates
    no data available. A return value of SOCKET_ERROR (-1)
    indicates an error condition. A return value of SOCKET_DISCONNECTED
    indicates the connection no longer exists.

