Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/berkeley_api.c
  Remarks:
    None.
 ***************************************************************************/
int recv(SOCKET s, char *buf, int len, int flags)
{
    struct BSDSocket *socket;

    if (s >= BSD_SOCKET_COUNT)
        return SOCKET_ERROR;

    socket = &BSDSocketArray[s];

    if (socket->SocketType == SOCK_STREAM) //TCP
    {
        if (socket->bsdState != SKT_EST)
            return SOCKET_ERROR;

        if (HandlePossibleTCPDisconnection(s))
            return SOCKET_ERROR;

        return TCPGetArray(socket->SocketID, (uint8_t *) buf, len);
    } else if (socket->SocketType == SOCK_DGRAM) //UDP
    {
        if (socket->bsdState != SKT_BOUND)
            return SOCKET_ERROR;

        if (UDPIsGetReady(socket->SocketID))
            return UDPGetArray((uint8_t *) buf, len);
    }

    return 0;
}

/*****************************************************************************
  Function:
    int recvfrom(SOCKET s, char *buf, int len, int flags, struct sockaddr *from, int *fromlen)

  Summary:
    The recvfrom() function is used to receive incoming data that
    has been queued for a socket.

  Description:
    The recvfrom() function is used to receive incoming data that
    has been queued for a socket. This function can be used with
    both datagram and stream type sockets. If the available data
    is too large to fit in the supplied application buffer buf,
    excess bytes are discarded in case of SOCK_DGRAM type
    sockets. For SOCK_STREAM types, the data is buffered
    internally so the application can retreive all data by
    multiple calls of recvfrom.

  Precondition:
    socket function should be called.

  Parameters:
    s - Socket descriptor returned from a previous call to socket.
    buf - application data receive buffer.
    len - buffer length in bytes.
    flags - message flags. Currently this is not supported.
    from - pointer to the sockaddr structure that will be
    filled in with the destination address.
    fromlen - size of buffer pointed by from.

  Returns:
    If recvfrom is successful, the number of bytes copied to
    application buffer buf is returned. A value of zero indicates
    no data available. A return value of SOCKET_ERROR (-1)
    indicates an error condition.

  Remarks:
    None.
 ***************************************************************************/
int recvfrom(SOCKET s, char *buf, int len, int flags, struct sockaddr *from, int *fromlen)
{
    struct BSDSocket *socket;
    struct sockaddr_in *rem_addr;
    SOCKET_INFO *remoteSockInfo;

    socket = &BSDSocketArray[s];
    rem_addr = (struct sockaddr_in *) from;

    if (socket->SocketType == SOCK_DGRAM) //UDP
    {
        // If this BSD socket doesn't have a Microchip UDP socket associated
        // with it yet, then no data can be received and we must not use the
        // socket->SocketID parameter, which isn't set yet.
        if (socket->bsdState != SKT_BOUND)
            return 0;

        if (UDPIsGetReady(socket->SocketID)) {
            // Capture sender information (can change packet to packet)
            if (from && fromlen) {
                if ((unsigned int) *fromlen >= sizeof (struct sockaddr_in)) {
                    rem_addr->sin_addr.S_un.S_addr = UDPSocketInfo[socket->SocketID].remote.remoteNode.IPAddr.Val;
                    rem_addr->sin_port = UDPSocketInfo[socket->SocketID].remotePort;
                    *fromlen = sizeof (struct sockaddr_in);
                }
            }

            return UDPGetArray((uint8_t *) buf, len);
        }
    } else // TCP recieve from already connected socket.
    {
        if (from && fromlen) {
            // Capture sender information (will always match socket connection information)
            if ((unsigned int) *fromlen >= sizeof (struct sockaddr_in)) {
                remoteSockInfo = TCPGetRemoteInfo(socket->SocketID);
                rem_addr->sin_addr.S_un.S_addr = remoteSockInfo->remote.IPAddr.Val;
                rem_addr->sin_port = remoteSockInfo->remotePort.Val;
                *fromlen = sizeof (struct sockaddr_in);
            }
        }
        return recv(s, buf, len, 0);
    }
    return 0;
}

/*****************************************************************************
  Function:
    int gethostname(char *name, int namelen )

  Summary:
    Returns the standard host name for the system.

  Description:
    This function returns the standard host name of the system which is
    calling this function.  The returned name is null-terminated.

  Precondition:
    None.

  Parameters:
    name - Pointer to a buffer that receives the local host name.
    namelen - size of the name array.

  Returns:
    Success will return a value of 0.
    If name is too short to hold the host name or any other error occurs,
    SOCKET_ERROR (-1) will be returned.  On error, *name will be unmodified
    and no null terminator will be generated.

  Remarks:
    None.
 ***************************************************************************/
int gethostname(char *name, int namelen)
{
    uint16_t wSourceLen;
    uint16_t w;
    uint8_t v;

    wSourceLen = sizeof (AppConfig.NetBIOSName);
    for (w = 0; w < wSourceLen; w++) {
        v = AppConfig.NetBIOSName[w];
        if ((v == ' ') || (v == 0u))
            break;
    }
    wSourceLen = w;
    if (namelen < (int) wSourceLen + 1)
        return SOCKET_ERROR;

    memcpy((void *) name, (void *) AppConfig.NetBIOSName, wSourceLen);
    name[wSourceLen] = 0;

    return 0;
}

/*****************************************************************************
  Function:
    int closesocket( SOCKET s )

  Summary:
    The closesocket function closes an existing socket.

  Description:
    The closesocket function closes an existing socket.
    This function releases the socket descriptor s.
    Any data buffered at the socket is discarded.  If the
    socket s is no longer needed, closesocket() must be
    called in order to release all resources associated with s.

  Precondition:
    None.

  Parameters:
    s - Socket descriptor returned from a previous call to socket

  Returns:
    If closesocket is successful, a value of 0 is returned.
    A return value of SOCKET_ERROR (-1) indicates an error.

