Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/berkeley_api.c
  Remarks:
    None.
 ***************************************************************************/
int closesocket(SOCKET s)
{
    uint8_t i;
    struct BSDSocket *socket;

    if (s >= BSD_SOCKET_COUNT)
        return SOCKET_ERROR;

    socket = &BSDSocketArray[s];

    if (socket->bsdState == SKT_CLOSED)
        return 0; // Nothing to do, so return success

    if (socket->SocketType == SOCK_STREAM) {
        if (socket->bsdState == SKT_BSD_LISTEN) {
            // This is a listerner handle, so when we close it we also should
            // close all TCP sockets that were opened for backlog processing
            // but didn't actually get connected
            for (i = 0; i < sizeof (BSDSocketArray) / sizeof (BSDSocketArray[0]); i++) {
                if (BSDSocketArray[i].bsdState != SKT_LISTEN)
                    continue;
                if (BSDSocketArray[i].localPort == socket->localPort) {
                    TCPClose(BSDSocketArray[i].SocketID);
                    BSDSocketArray[i].bsdState = SKT_CLOSED;
                }
            }
        } else if (socket->bsdState >= SKT_LISTEN) {
            // For server sockets, if the parent listening socket is still open,
            // then return this socket to the queue for future backlog processing.
            if (socket->isServer) {
                for (i = 0; i < sizeof (BSDSocketArray) / sizeof (BSDSocketArray[0]); i++) {
                    if (BSDSocketArray[i].bsdState != SKT_BSD_LISTEN)
                        continue;
                    if (BSDSocketArray[i].localPort == socket->localPort) {
                        TCPDisconnect(socket->SocketID);

                        // Listener socket is still open, so just return to the
                        // listening state so that the user must call accept() again to
                        // reuse this BSD socket
                        socket->bsdState = SKT_LISTEN;
                        return 0;
                    }
                }
                // If we get down here, then the parent listener socket has
                // apparently already been closed, so this socket can not be
                // reused.  Close it complete.
                TCPClose(socket->SocketID);
            } else if (socket->bsdState != SKT_DISCONNECTED) // this is a client socket that isn't already disconnected
            {
                TCPClose(socket->SocketID);
            }
        }
    } else // udp sockets
    {
        if (socket->bsdState == SKT_BOUND)
            UDPClose(socket->SocketID);
    }

    socket->bsdState = SKT_CLOSED;
    return 0; // success
}

/*****************************************************************************
  Function:
    static bool HandlePossibleTCPDisconnection(SOCKET s)

  Summary:
    Internal function that checks for asynchronous TCP connection state
    changes and resynchs the BSD socket descriptor state to match.

  Description:
    Internal function that checks for asynchronous TCP connection state
    changes and resynchs the BSD socket descriptor state to match.

  Precondition:
    None

  Parameters:
    s - TCP type socket descriptor returned from a previous call to socket.
        This socket must be in the SKT_LISTEN, SKT_IN_PROGRESS, SKT_EST, or
        SKT_DISCONNECTED states.

  Returns:
    true - Socket is disconnected
    false - Socket is

 ***************************************************************************/
static bool HandlePossibleTCPDisconnection(SOCKET s)
{
    struct BSDSocket *socket;
    uint8_t i;
    bool bSocketWasReset;

    socket = &BSDSocketArray[s];

    // Nothing to do if disconnection has already been handled
    if (socket->bsdState == SKT_DISCONNECTED)
        return true;

    // Find out if a disconnect has occurred
    bSocketWasReset = TCPWasReset(socket->SocketID);

    // For server sockets, if the parent listening socket is still open,
    // then return this socket to the queue for future backlog processing.
    if (socket->isServer) {
        for (i = 0; i < sizeof (BSDSocketArray) / sizeof (BSDSocketArray[0]); i++) {
            if (BSDSocketArray[i].bsdState != SKT_BSD_LISTEN)
                continue;
            if (BSDSocketArray[i].localPort == socket->localPort) {
                // Nothing to do if a disconnect has not occurred
                if (!bSocketWasReset)
                    return false;

                // Listener socket is still open, so just return to the
                // listening state so that the user must call accept() again to
                // reuse this BSD socket
                socket->bsdState = SKT_LISTEN;
                return true;
            }
        }
    }

    // If we get down here and the socket was reset, then this socket
    // should be closed so that no more clients can connect to it.  However,
    // we can't go to the BSD SKT_CLOSED state directly since the user still
    // has to call closesocket() with this s SOCKET descriptor first.
    if (bSocketWasReset) {
        TCPClose(socket->SocketID);
        socket->bsdState = SKT_DISCONNECTED;
        return true;
    }

    return false;
}

#endif // STACK_USE_BERKELEY_API
